[
  {
    "title": "Peace | Advent | Luke 2:8-10",
    "description": "And there were shepherds living out in the fields nearby, keeping watch over their flocks at night. An angel of the Lord appeared to them, and the glory of the Lord shone around them, and they were terrified. But the angel said to them, “Do not be afraid. I bring you good news that will cause great joy for all the people.",
    "date": "2025-12-15T09:40:42+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/_eRaLFKdUr0/maxresdefault.webp",
    "video_id": "_eRaLFKdUr0",
    "timestamp": 1765791642
  },
  {
    "title": "Hope is Here | Advent | 1 Samuel 1:4-20",
    "description": "4 Whenever the day came for Elkanah to sacrifice, he would give portions of the meat to his wife Peninnah and to all her sons and daughters. 5 But to Hannah he gave a double portion because he loved her, and the Lord had closed her womb. 6 Because the Lord had closed Hannah’s womb, her rival kept provoking her in order to irritate her. 7 This went on year after year. Whenever Hannah went up to the house of the Lord, her rival provoked her till she wept and would not eat. 8 Her husband Elkanah would say to her, “Hannah, why are you weeping? Why don’t you eat? Why are you downhearted? Don’t I mean more to you than ten sons?”\n\n9 Once when they had finished eating and drinking in Shiloh, Hannah stood up. Now Eli the priest was sitting on his chair by the doorpost of the Lord’s house. 10 In her deep anguish Hannah prayed to the Lord, weeping bitterly. 11 And she made a vow, saying, “Lord Almighty, if you will only look on your servant’s misery and remember me, and not forget your servant but give her a son, then I will give him to the Lord for all the days of his life, and no razor will ever be used on his head.”\n\n12 As she kept on praying to the Lord, Eli observed her mouth. 13 Hannah was praying in her heart, and her lips were moving but her voice was not heard. Eli thought she was drunk 14 and said to her, “How long are you going to stay drunk? Put away your wine.”\n\n15 “Not so, my lord,” Hannah replied, “I am a woman who is deeply troubled. I have not been drinking wine or beer; I was pouring out my soul to the Lord. 16 Do not take your servant for a wicked woman; I have been praying here out of my great anguish and grief.”\n\n17 Eli answered, “Go in peace, and may the God of Israel grant you what you have asked of him.”\n\n18 She said, “May your servant find favor in your eyes.” Then she went her way and ate something, and her face was no longer downcast.\n\n19 Early the next morning they arose and worshiped before the Lord and then went back to their home at Ramah. Elkanah made love to his wife Hannah, and the Lord remembered her. 20 So in the course of time Hannah became pregnant and gave birth to a son. She named him Samuel,[a] saying, “Because I asked the Lord for him.”",
    "date": "2025-12-08T09:49:33+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/AWoBm4E3W2c/maxresdefault.webp",
    "video_id": "AWoBm4E3W2c",
    "timestamp": 1765187373
  },
  {
    "title": "Advent '24 | Love",
    "description": "",
    "date": "2024-12-23T09:30:58+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/4OEg-OLgcjU/maxresdefault.webp",
    "video_id": "4OEg-OLgcjU",
    "timestamp": 1734946258
  },
  {
    "title": "Advent '24 | Joy",
    "description": "",
    "date": "2024-12-16T09:34:58+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/WKHhjFzKcxY/maxresdefault.webp",
    "video_id": "WKHhjFzKcxY",
    "timestamp": 1734341698
  },
  {
    "title": "Advent '24 | Peace",
    "description": "",
    "date": "2024-12-09T09:40:55+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/3Oav5or0nB4/maxresdefault.webp",
    "video_id": "3Oav5or0nB4",
    "timestamp": 1733737255
  },
  {
    "title": "Advent '24 | Hope",
    "description": "",
    "date": "2024-12-02T09:26:38+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/4aKQqiwE5sQ/maxresdefault.webp",
    "video_id": "4aKQqiwE5sQ",
    "timestamp": 1733131598
  }
]