[
  {
    "title": "Jesus in Gethsemane | Mark 14:32-52",
    "description": "Gethsemane\nThey went to a place called Gethsemane, and Jesus said to his disciples, “Sit here while I pray.” He took Peter, James and John along with him, and he began to be deeply distressed and troubled. “My soul is overwhelmed with sorrow to the point of death,” he said to them. “Stay here and keep watch.”\n\nGoing a little farther, he fell to the ground and prayed that if possible the hour might pass from him. “Abba, Father,” he said, “everything is possible for you. Take this cup from me. Yet not what I will, but what you will.”\n\nThen he returned to his disciples and found them sleeping. “Simon,” he said to Peter, “are you asleep? Couldn’t you keep watch for one hour? Watch and pray so that you will not fall into temptation. The spirit is willing, but the flesh is weak.”\n\nOnce more he went away and prayed the same thing. When he came back, he again found them sleeping, because their eyes were heavy. They did not know what to say to him.\n\nReturning the third time, he said to them, “Are you still sleeping and resting? Enough! The hour has come. Look, the Son of Man is delivered into the hands of sinners. Rise! Let us go! Here comes my betrayer!”\n\nJesus Arrested\nJust as he was speaking, Judas, one of the Twelve, appeared. With him was a crowd armed with swords and clubs, sent from the chief priests, the teachers of the law, and the elders.\n\nNow the betrayer had arranged a signal with them: “The one I kiss is the man; arrest him and lead him away under guard.” Going at once to Jesus, Judas said, “Rabbi!” and kissed him. The men seized Jesus and arrested him. Then one of those standing near drew his sword and struck the servant of the high priest, cutting off his ear.\n\n“Am I leading a rebellion,” said Jesus, “that you have come out with swords and clubs to capture me? Every day I was with you, teaching in the temple courts, and you did not arrest me. But the Scriptures must be fulfilled.” Then everyone deserted him and fled.\n\nA young man, wearing nothing but a linen garment, was following Jesus. When they seized him, he fled naked, leaving his garment behind.",
    "date": "2025-10-13T09:36:14+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/bl9_2tPWVkw/maxresdefault.webp",
    "video_id": "bl9_2tPWVkw",
    "timestamp": 1760348174
  },
  {
    "title": "The Last Supper | Mark 14:12-31",
    "description": "Mark 14.12-31\n12 On the first day of the Festival of Unleavened Bread, when the Passover lamb is sacrificed, Jesus’ disciples asked him, “Where do you want us to go to prepare the Passover meal for you?”\n13 So Jesus sent two of them into Jerusalem with these instructions: “As you go into the city, a man carrying a pitcher of water will meet you. Follow him. 14 At the house he enters, say to the owner, ‘The Teacher asks: Where is the guest room where I can eat the Passover meal with my disciples?’15 He will take you upstairs to a large room that is already set up. That is where you should prepare our meal.” 16 So the two disciples went into the city and found everything just as Jesus had said, and they prepared the Passover meal there.\n17 In the evening Jesus arrived with the Twelve. 18 As they were at the table eating, Jesus said, “I tell you the truth, one of you eating with me here will betray me.”\n19 Greatly distressed, each one asked in turn, “Am I the one?”\n20 He replied, “It is one of you twelve who is eating from this bowl with me.21 For the Son of Man must die, as the Scriptures declared long ago. But how terrible it will be for the one who betrays him. It would be far better for that man if he had never been born!”\n22 As they were eating, Jesus took some bread and blessed it. Then he broke it in pieces and gave it to the disciples, saying, “Take it, for this is my body.”\n23 And he took a cup of wine and gave thanks to God for it. He gave it to them, and they all drank from it. 24 And he said to them, “This is my blood, which confirms the covenant[c] between God and his people. It is poured out as a sacrifice for many. 25 I tell you the truth, I will not drink wine again until the day I drink it new in the Kingdom of God.”\n26 Then they sang a hymn and went out to the Mount of Olives.\n27 On the way, Jesus told them, “All of you will desert me. For the Scriptures say,\n‘God will strike the Shepherd,    and the sheep will be scattered.’\n28 But after I am raised from the dead, I will go ahead of you to Galilee and meet you there.”\n29 Peter said to him, “Even if everyone else deserts you, I never will.”\n30 Jesus replied, “I tell you the truth, Peter—this very night, before the rooster crows twice, you will deny three times that you even know me.”\n31 “No!” Peter declared emphatically. “Even if I have to die with you, I will never deny you!” And all the others vowed the same.",
    "date": "2025-09-29T09:41:37+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/TA4Ix_KryRw/maxresdefault.webp",
    "video_id": "TA4Ix_KryRw",
    "timestamp": 1759138897
  },
  {
    "title": "Anointed for Burial | Mark",
    "description": "Mark 14:1-11\n\nJesus Anointed at Bethany\nNow the Passover and the Festival of Unleavened Bread were only two days away, and the chief priests and the teachers of the law were scheming to arrest Jesus secretly and kill him. “But not during the festival,” they said, “or the people may riot.”\n\nWhile he was in Bethany, reclining at the table in the home of Simon the Leper, a woman came with an alabaster jar of very expensive perfume, made of pure nard. She broke the jar and poured the perfume on his head.\n\nSome of those present were saying indignantly to one another, “Why this waste of perfume? It could have been sold for more than a year’s wages and the money given to the poor.” And they rebuked her harshly.\n\n“Leave her alone,” said Jesus. “Why are you bothering her? She has done a beautiful thing to me. The poor you will always have with you, and you can help them any time you want. But you will not always have me. She did what she could. She poured perfume on my body beforehand to prepare for my burial. Truly I tell you, wherever the gospel is preached throughout the world, what she has done will also be told, in memory of her.”\n\nThen Judas Iscariot, one of the Twelve, went to the chief priests to betray Jesus to them. They were delighted to hear this and promised to give him money. So he watched for an opportunity to hand him over.",
    "date": "2025-09-22T09:33:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/NkR8suLwMjU/maxresdefault.webp",
    "video_id": "NkR8suLwMjU",
    "timestamp": 1758533601
  },
  {
    "title": "Watch & Be Ready | Mark",
    "description": "Mark 13:24-37\n\n“But in those days, following that distress,\n\n“‘the sun will be darkened,\n    and the moon will not give its light;\nthe stars will fall from the sky,\n    and the heavenly bodies will be shaken.’\n\n“At that time people will see the Son of Man coming in clouds with great power and glory. And he will send his angels and gather his elect from the four winds, from the ends of the earth to the ends of the heavens.\n\n“Now learn this lesson from the fig tree: As soon as its twigs get tender and its leaves come out, you know that summer is near. Even so, when you see these things happening, you know that it is near, right at the door. Truly I tell you, this generation will certainly not pass away until all these things have happened. Heaven and earth will pass away, but my words will never pass away.\n\nThe Day and Hour Unknown\n“But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father. Be on guard! Be alert! You do not know when that time will come. It’s like a man going away: He leaves his house and puts his servants in charge, each with their assigned task, and tells the one at the door to keep watch.\n\n“Therefore keep watch because you do not know when the owner of the house will come back—whether in the evening, or at midnight, or when the rooster crows, or at dawn. If he comes suddenly, do not let him find you sleeping. What I say to you, I say to everyone: ‘Watch!’”",
    "date": "2025-09-15T09:43:49+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/uoHKB1BMgrE/maxresdefault.webp",
    "video_id": "uoHKB1BMgrE",
    "timestamp": 1757929429
  },
  {
    "title": "Signs of the End | Mark 13:1-24",
    "description": "The Destruction of the Temple and Signs of the End Times\nAs Jesus was leaving the temple, one of his disciples said to him, “Look, Teacher! What massive stones! What magnificent buildings!”\n\n“Do you see all these great buildings?” replied Jesus. “Not one stone here will be left on another; every one will be thrown down.”\n\nAs Jesus was sitting on the Mount of Olives opposite the temple, Peter, James, John and Andrew asked him privately, “Tell us, when will these things happen? And what will be the sign that they are all about to be fulfilled?”\n\nJesus said to them: “Watch out that no one deceives you. Many will come in my name, claiming, ‘I am he,’ and will deceive many. When you hear of wars and rumors of wars, do not be alarmed. Such things must happen, but the end is still to come. Nation will rise against nation, and kingdom against kingdom. There will be earthquakes in various places, and famines. These are the beginning of birth pains.\n\n“You must be on your guard. You will be handed over to the local councils and flogged in the synagogues. On account of me you will stand before governors and kings as witnesses to them. And the gospel must first be preached to all nations. Whenever you are arrested and brought to trial, do not worry beforehand about what to say. Just say whatever is given you at the time, for it is not you speaking, but the Holy Spirit.\n\n“Brother will betray brother to death, and a father his child. Children will rebel against their parents and have them put to death. Everyone will hate you because of me, but the one who stands firm to the end will be saved.\n\n“When you see ‘the abomination that causes desolation’ standing where it does not belong—let the reader understand—then let those who are in Judea flee to the mountains. Let no one on the housetop go down or enter the house to take anything out. Let no one in the field go back to get their cloak. How dreadful it will be in those days for pregnant women and nursing mothers! Pray that this will not take place in winter, because those will be days of distress unequaled from the beginning, when God created the world, until now—and never to be equaled again.\n\n“If the Lord had not cut short those days, no one would survive. But for the sake of the elect, whom he has chosen, he has shortened them. At that time if anyone says to you, ‘Look, here is the Messiah!’ or, ‘Look, there he is!’ do not believe it. For false messiahs and false prophets will appear and perform signs and wonders to deceive, if possible, even the elect. So be on your guard; I have told you everything ahead of time.\n\n“But in those days, following that distress,\n\n“‘the sun will be darkened,\n    and the moon will not give its light;\nthe stars will fall from the sky,\n    and the heavenly bodies will be shaken.’\n\n“At that time people will see the Son of Man coming in clouds with great power and glory. And he will send his angels and gather his elect from the four winds, from the ends of the earth to the ends of the heavens.\n\n“Now learn this lesson from the fig tree: As soon as its twigs get tender and its leaves come out, you know that summer is near. Even so, when you see these things happening, you know that it is near, right at the door. Truly I tell you, this generation will certainly not pass away until all these things have happened. Heaven and earth will pass away, but my words will never pass away.\n\nThe Day and Hour Unknown\n“But about that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father. Be on guard! Be alert! You do not know when that time will come. It’s like a man going away: He leaves his house and puts his servants in charge, each with their assigned task, and tells the one at the door to keep watch.\n\n“Therefore keep watch because you do not know when the owner of the house will come back—whether in the evening, or at midnight, or when the rooster crows, or at dawn. If he comes suddenly, do not let him find you sleeping. What I say to you, I say to everyone: ‘Watch!’”",
    "date": "2025-09-08T12:19:05+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/WyNfM8kEJpE/maxresdefault.webp",
    "video_id": "WyNfM8kEJpE",
    "timestamp": 1757333945
  },
  {
    "title": "Mark | Hypocrites & Widows",
    "description": "Mark 12:38-44\n\nWarning Against the Teachers of the Law\nAs he taught, Jesus said, “Watch out for the teachers of the law. They like to walk around in flowing robes and be greeted with respect in the marketplaces, and have the most important seats in the synagogues and the places of honor at banquets. They devour widows’ houses and for a show make lengthy prayers. These men will be punished most severely.”\n\nThe Widow’s Offering\nJesus sat down opposite the place where the offerings were put and watched the crowd putting their money into the temple treasury. Many rich people threw in large amounts. But a poor widow came and put in two very small copper coins, worth only a few cents.\n\nCalling his disciples to him, Jesus said, “Truly I tell you, this poor widow has put more into the treasury than all the others. They all gave out of their wealth; but she, out of her poverty, put in everything—all she had to live on.”",
    "date": "2025-08-25T09:40:34+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/M7Ieg4Pj5R8/maxresdefault.webp",
    "video_id": "M7Ieg4Pj5R8",
    "timestamp": 1756114834
  },
  {
    "title": "Mark | Silencing the Critics",
    "description": "Mark 12:13-27\n\nPaying the Imperial Tax to Caesar\nLater they sent some of the Pharisees and Herodians to Jesus to catch him in his words. They came to him and said, “Teacher, we know that you are a man of integrity. You aren’t swayed by others, because you pay no attention to who they are; but you teach the way of God in accordance with the truth. Is it right to pay the imperial tax to Caesar or not? Should we pay or shouldn’t we?”\n\nBut Jesus knew their hypocrisy. “Why are you trying to trap me?” he asked. “Bring me a denarius and let me look at it.” They brought the coin, and he asked them, “Whose image is this? And whose inscription?”\n\n“Caesar’s,” they replied.\n\nThen Jesus said to them, “Give back to Caesar what is Caesar’s and to God what is God’s.”\n\nAnd they were amazed at him.\n\nMarriage at the Resurrection\nThen the Sadducees, who say there is no resurrection, came to him with a question. “Teacher,” they said, “Moses wrote for us that if a man’s brother dies and leaves a wife but no children, the man must marry the widow and raise up offspring for his brother. Now there were seven brothers. The first one married and died without leaving any children. The second one married the widow, but he also died, leaving no child. It was the same with the third. In fact, none of the seven left any children. Last of all, the woman died too. At the resurrection whose wife will she be, since the seven were married to her?”\n\nJesus replied, “Are you not in error because you do not know the Scriptures or the power of God? When the dead rise, they will neither marry nor be given in marriage; they will be like the angels in heaven. Now about the dead rising—have you not read in the Book of Moses, in the account of the burning bush, how God said to him, ‘I am the God of Abraham, the God of Isaac, and the God of Jacob’? He is not the God of the dead, but of the living. You are badly mistaken!”",
    "date": "2025-08-18T09:30:13+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/z6X13Zll1Ks/maxresdefault.webp",
    "video_id": "z6X13Zll1Ks",
    "timestamp": 1755509413
  },
  {
    "title": "Mark |",
    "description": "Jesus Comes to Jerusalem as King\nAs they approached Jerusalem and came to Bethphage and Bethany at the Mount of Olives, Jesus sent two of his disciples, saying to them, “Go to the village ahead of you, and just as you enter it, you will find a colt tied there, which no one has ever ridden. Untie it and bring it here. If anyone asks you, ‘Why are you doing this?’ say, ‘The Lord needs it and will send it back here shortly.’”\n\nThey went and found a colt outside in the street, tied at a doorway. As they untied it, some people standing there asked, “What are you doing, untying that colt?” They answered as Jesus had told them to, and the people let them go. When they brought the colt to Jesus and threw their cloaks over it, he sat on it. Many people spread their cloaks on the road, while others spread branches they had cut in the fields. Those who went ahead and those who followed shouted,\n\n“Hosanna!”\n\n“Blessed is he who comes in the name of the Lord!”\n\n“Blessed is the coming kingdom of our father David!”\n\n“Hosanna in the highest heaven!”\n\nJesus entered Jerusalem and went into the temple courts. He looked around at everything, but since it was already late, he went out to Bethany with the Twelve.",
    "date": "2025-08-11T09:41:29+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/NMxh1rK1yto/maxresdefault.webp",
    "video_id": "NMxh1rK1yto",
    "timestamp": 1754905289
  },
  {
    "title": "Mark | Who can be saved?",
    "description": "# Mark 10:17-31\n\nThe Rich Young Man\n17 And as he was setting out on his journey, a man ran up and knelt before him and asked him, “Good Teacher, what must I do to inherit eternal life?” 18 And Jesus said to him, “Why do you call me good? No one is good except God alone. 19 You know the commandments: ‘Do not murder, Do not commit adultery, Do not steal, Do not bear false witness, Do not defraud, Honor your father and mother.’” 20 And he said to him, “Teacher, all these I have kept from my youth.” 21 And Jesus, looking at him, loved him, and said to him, “You lack one thing: go, sell all that you have and give to the poor, and you will have treasure in heaven; and come, follow me.” 22 Disheartened by the saying, he went away sorrowful, for he had great possessions.\n\n23 And Jesus looked around and said to his disciples, “How difficult it will be for those who have wealth to enter the kingdom of God!” 24 And the disciples were amazed at his words. But Jesus said to them again, “Children, how difficult it is[a] to enter the kingdom of God! 25 It is easier for a camel to go through the eye of a needle than for a rich person to enter the kingdom of God.” 26 And they were exceedingly astonished, and said to him,[b] “Then who can be saved?” 27 Jesus looked at them and said, “With man it is impossible, but not with God. For all things are possible with God.” 28 Peter began to say to him, “See, we have left everything and followed you.” 29 Jesus said, “Truly, I say to you, there is no one who has left house or brothers or sisters or mother or father or children or lands, for my sake and for the gospel, 30 who will not receive a hundredfold now in this time, houses and brothers and sisters and mothers and children and lands, with persecutions, and in the age to come eternal life. 31 But many who are first will be last, and the last first.”",
    "date": "2025-05-26T09:37:42+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/rscqpNW4cJw/maxresdefault.webp",
    "video_id": "rscqpNW4cJw",
    "timestamp": 1748252262
  },
  {
    "title": "Mark | Marriage & Divorce",
    "description": "Mark 10:1-16 \nThen Jesus left Capernaum and went down to the region of Judea and into the area east of the Jordan River. Once again crowds gathered around him, and as usual he was teaching them.\n\n2 Some Pharisees came and tried to trap him with this question: “Should a man be allowed to divorce his wife?”\n\n3 Jesus answered them with a question: “What did Moses say in the law about divorce?”\n\n4 “Well, he permitted it,” they replied. “He said a man can give his wife a written notice of divorce and send her away.”[a]\n\n5 But Jesus responded, “He wrote this commandment only as a concession to your hard hearts. 6 But ‘God made them male and female’[b] from the beginning of creation. 7 ‘This explains why a man leaves his father and mother and is joined to his wife,[c] 8 and the two are united into one.’[d] Since they are no longer two but one, 9 let no one split apart what God has joined together.”\n\n10 Later, when he was alone with his disciples in the house, they brought up the subject again. 11 He told them, “Whoever divorces his wife and marries someone else commits adultery against her. 12 And if a woman divorces her husband and marries someone else, she commits adultery.”\n\nJesus Blesses the Children\n\n13 One day some parents brought their children to Jesus so he could touch and bless them. But the disciples scolded the parents for bothering him.\n\n14 When Jesus saw what was happening, he was angry with his disciples. He said to them, “Let the children come to me. Don’t stop them! For the Kingdom of God belongs to those who are like these children. 15 I tell you the truth, anyone who doesn’t receive the Kingdom of God like a child will never enter it.” 16 Then he took the children in his arms and placed his hands on their heads and blessed them.",
    "date": "2025-05-19T09:31:20+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/cCrV0vF0s7o/maxresdefault.webp",
    "video_id": "cCrV0vF0s7o",
    "timestamp": 1747647080
  },
  {
    "title": "Mark | Jesus, the Teacher",
    "description": "Mark 9:30-50 \n30 Leaving that region, they traveled through Galilee. Jesus didn’t want anyone to know he was there, 31 for he wanted to spend more time with his disciples and teach them. He said to them, “The Son of Man is going to be betrayed into the hands of his enemies. He will be killed, but three days later he will rise from the dead.” 32 They didn’t understand what he was saying, however, and they were afraid to ask him what he meant.\n\nThe Greatest in the Kingdom\n\n33 After they arrived at Capernaum and settled in a house, Jesus asked his disciples, “What were you discussing out on the road?” 34 But they didn’t answer, because they had been arguing about which of them was the greatest. 35 He sat down, called the twelve disciples over to him, and said, “Whoever wants to be first must take last place and be the servant of everyone else.”\n\n36 Then he put a little child among them. Taking the child in his arms, he said to them, 37 “Anyone who welcomes a little child like this on my behalf[a] welcomes me, and anyone who welcomes me welcomes not only me but also my Father who sent me.”\n\nUsing the Name of Jesus\n\n38 John said to Jesus, “Teacher, we saw someone using your name to cast out demons, but we told him to stop because he wasn’t in our group.”\n\n39 “Don’t stop him!” Jesus said. “No one who performs a miracle in my name will soon be able to speak evil of me. 40 Anyone who is not against us is for us. 41 If anyone gives you even a cup of water because you belong to the Messiah, I tell you the truth, that person will surely be rewarded.\n\n42 “But if you cause one of these little ones who trusts in me to fall into sin, it would be better for you to be thrown into the sea with a large millstone hung around your neck. 43 If your hand causes you to sin, cut it off. It’s better to enter eternal life with only one hand than to go into the unquenchable fires of hell[b] with two hands.[c] 45 If your foot causes you to sin, cut it off. It’s better to enter eternal life with only one foot than to be thrown into hell with two feet.[d] 47 And if your eye causes you to sin, gouge it out. It’s better to enter the Kingdom of God with only one eye than to have two eyes and be thrown into hell, 48 ‘where the maggots never die and the fire never goes out.’[e]\n\n49 “For everyone will be tested with fire.[f] 50 Salt is good for seasoning. But if it loses its flavor, how do you make it salty again? You must have the qualities of salt among yourselves and live in peace with each other.”",
    "date": "2025-05-12T09:27:13+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/XMni1ofJY2g/maxresdefault.webp",
    "video_id": "XMni1ofJY2g",
    "timestamp": 1747042033
  },
  {
    "title": "Mark | The Limitless God",
    "description": "Mark 9:2-29 \n2 Six days later Jesus took Peter, James, and John, and led them up a high mountain to be alone. As the men watched, Jesus’ appearance was transformed, 3 and his clothes became dazzling white, far whiter than any earthly bleach could ever make them. 4 Then Elijah and Moses appeared and began talking with Jesus.\n\n5 Peter exclaimed, “Rabbi, it’s wonderful for us to be here! Let’s make three shelters as memorials—one for you, one for Moses, and one for Elijah.” 6 He said this because he didn’t really know what else to say, for they were all terrified.\n\n7 Then a cloud overshadowed them, and a voice from the cloud said, “This is my dearly loved Son. Listen to him.” 8 Suddenly, when they looked around, Moses and Elijah were gone, and they saw only Jesus with them.\n\n9 As they went back down the mountain, he told them not to tell anyone what they had seen until the Son of Man had risen from the dead. 10 So they kept it to themselves, but they often asked each other what he meant by “rising from the dead.”\n\n11 Then they asked him, “Why do the teachers of religious law insist that Elijah must return before the Messiah comes?”\n\n12 Jesus responded, “Elijah is indeed coming first to get everything ready. Yet why do the Scriptures say that the Son of Man must suffer greatly and be treated with utter contempt? 13 But I tell you, Elijah has already come, and they chose to abuse him, just as the Scriptures predicted.”\n\nJesus Heals a Demon-Possessed Boy\n\n14 When they returned to the other disciples, they saw a large crowd surrounding them, and some teachers of religious law were arguing with them. 15 When the crowd saw Jesus, they were overwhelmed with awe, and they ran to greet him.\n\n16 “What is all this arguing about?” Jesus asked.\n\n17 One of the men in the crowd spoke up and said, “Teacher, I brought my son so you could heal him. He is possessed by an evil spirit that won’t let him talk. 18 And whenever this spirit seizes him, it throws him violently to the ground. Then he foams at the mouth and grinds his teeth and becomes rigid. So I asked your disciples to cast out the evil spirit, but they couldn’t do it.”\n\n19 Jesus said to them, “You faithless people! How long must I be with you? How long must I put up with you? Bring the boy to me.”\n\n20 So they brought the boy. But when the evil spirit saw Jesus, it threw the child into a violent convulsion, and he fell to the ground, writhing and foaming at the mouth.\n\n21 “How long has this been happening?” Jesus asked the boy’s father.\n\nHe replied, “Since he was a little boy. 22 The spirit often throws him into the fire or into water, trying to kill him. Have mercy on us and help us, if you can.”\n\n23 “What do you mean, ‘If I can’?” Jesus asked. “Anything is possible if a person believes.”\n\n24 The father instantly cried out, “I do believe, but help me overcome my unbelief!”\n\n25 When Jesus saw that the crowd of onlookers was growing, he rebuked the evil spirit. “Listen, you spirit that makes this boy unable to hear and speak,” he said. “I command you to come out of this child and never enter him again!”\n\n26 Then the spirit screamed and threw the boy into another violent convulsion and left him. The boy appeared to be dead. A murmur ran through the crowd as people said, “He’s dead.” 27 But Jesus took him by the hand and helped him to his feet, and he stood up.\n\n28 Afterward, when Jesus was alone in the house with his disciples, they asked him, “Why couldn’t we cast out that evil spirit?”\n\n29 Jesus replied, “This kind can be cast out only by prayer.”",
    "date": "2025-05-05T09:22:35+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/OteZbsnOnXQ/maxresdefault.webp",
    "video_id": "OteZbsnOnXQ",
    "timestamp": 1746436955
  },
  {
    "title": "Mark | The Cost to Follow Jesus",
    "description": "Mark 8:34 - 9:1 \n34 Then, calling the crowd to join his disciples, he said, “If any of you wants to be my follower, you must give up your own way, take up your cross, and follow me. 35 If you try to hang on to your life, you will lose it. But if you give up your life for my sake and for the sake of the Good News, you will save it. 36 And what do you benefit if you gain the whole world but lose your own soul?[a] 37 Is anything worth more than your soul? 38 If anyone is ashamed of me and my message in these adulterous and sinful days, the Son of Man will be ashamed of that person when he returns in the glory of his Father with the holy angels.”\n\n9 Jesus went on to say, “I tell you the truth, some standing here right now will not die before they see the Kingdom of God arrive in great power!”",
    "date": "2025-04-28T09:22:38+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/4pnIWGySGYA/maxresdefault.webp",
    "video_id": "4pnIWGySGYA",
    "timestamp": 1745832158
  },
  {
    "title": "Palm Sunday | The Subversive King",
    "description": "Luke 19:28-40 \n28 And when he had said these things, he went on ahead, going up to Jerusalem. 29 When he drew near to Bethphage and Bethany, at the mount that is called Olivet, he sent two of the disciples, 30 saying, “Go into the village in front of you, where on entering you will find a colt tied, on which no one has ever yet sat. Untie it and bring it here. 31 If anyone asks you, ‘Why are you untying it?’ you shall say this: ‘The Lord has need of it.’” 32 So those who were sent went away and found it just as he had told them. 33 And as they were untying the colt, its owners said to them, “Why are you untying the colt?” 34 And they said, “The Lord has need of it.” 35 And they brought it to Jesus, and throwing their cloaks on the colt, they set Jesus on it. 36 And as he rode along, they spread their cloaks on the road. 37 As he was drawing near—already on the way down the Mount of Olives—the whole multitude of his disciples began to rejoice and praise God with a loud voice for all the mighty works that they had seen, 38 saying, “Blessed is the King who comes in the name of the Lord! Peace in heaven and glory in the highest!” 39 And some of the Pharisees in the crowd said to him, “Teacher, rebuke your disciples.” 40 He answered, “I tell you, if these were silent, the very stones would cry out.”",
    "date": "2025-04-14T09:36:20+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/IBwkBvQuqdg/maxresdefault.webp",
    "video_id": "IBwkBvQuqdg",
    "timestamp": 1744623380
  },
  {
    "title": "Mark | Who is Jesus?",
    "description": "Mark 8:22-33 \n22 When they arrived at Bethsaida, some people brought a blind man to Jesus, and they begged him to touch the man and heal him. 23 Jesus took the blind man by the hand and led him out of the village. Then, spitting on the man’s eyes, he laid his hands on him and asked, “Can you see anything now?”\n\n24 The man looked around. “Yes,” he said, “I see people, but I can’t see them very clearly. They look like trees walking around.”\n\n25 Then Jesus placed his hands on the man’s eyes again, and his eyes were opened. His sight was completely restored, and he could see everything clearly. 26 Jesus sent him away, saying, “Don’t go back into the village on your way home.”\n\nPeter’s Declaration about Jesus\n\n27 Jesus and his disciples left Galilee and went up to the villages near Caesarea Philippi. As they were walking along, he asked them, “Who do people say I am?”\n\n28 “Well,” they replied, “some say John the Baptist, some say Elijah, and others say you are one of the other prophets.”\n\n29 Then he asked them, “But who do you say I am?”\n\nPeter replied, “You are the Messiah.”\n\n30 But Jesus warned them not to tell anyone about him.\n\nJesus Predicts His Death\n\n31 Then Jesus began to tell them that the Son of Man must suffer many terrible things and be rejected by the elders, the leading priests, and the teachers of religious law. He would be killed, but three days later he would rise from the dead. 32 As he talked about this openly with his disciples, Peter took him aside and began to reprimand him for saying such things.\n\n33 Jesus turned around and looked at his disciples, then reprimanded Peter. “Get away from me, Satan!” he said. “You are seeing things merely from a human point of view, not from God’s.”",
    "date": "2025-04-07T09:38:05+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/jk7_-F9g4ig/maxresdefault.webp",
    "video_id": "jk7_-F9g4ig",
    "timestamp": 1744018685
  },
  {
    "title": "Mark | Doubting the Lord",
    "description": "Mark 8:1-21 \nAbout this time another large crowd had gathered, and the people ran out of food again. Jesus called his disciples and told them, 2 “I feel sorry for these people. They have been here with me for three days, and they have nothing left to eat. 3 If I send them home hungry, they will faint along the way. For some of them have come a long distance.”\n\n4 His disciples replied, “How are we supposed to find enough food to feed them out here in the wilderness?”5 Jesus asked, “How much bread do you have?”\n“Seven loaves,” they replied.\n\n6 So Jesus told all the people to sit down on the ground. Then he took the seven loaves, thanked God for them, and broke them into pieces. He gave them to his disciples, who distributed the bread to the crowd. 7 A few small fish were found, too, so Jesus also blessed these and told the disciples to distribute them.\n\n8 They ate as much as they wanted. Afterward, the disciples picked up seven large baskets of leftover food. 9 There were about 4,000 men in the crowd that day, and Jesus sent them home after they had eaten. 10 Immediately after this, he got into a boat with his disciples and crossed over to the region of Dalmanutha.\n\n11 When the Pharisees heard that Jesus had arrived, they came and started to argue with him. Testing him, they demanded that he show them a miraculous sign from heaven to prove his authority.\n\n12 When he heard this, he sighed deeply in his spirit and said, “Why do these people keep demanding a miraculous sign? I tell you the truth, I will not give this generation any such sign.” 13 So he got back into the boat and left them, and he crossed to the other side of the lake.\n\nYeast of the Pharisees and Herod\n\n14 But the disciples had forgotten to bring any food. They had only one loaf of bread with them in the boat. 15 As they were crossing the lake, Jesus warned them, “Watch out! Beware of the yeast of the Pharisees and of Herod.”\n\n16 At this they began to argue with each other because they hadn’t brought any bread. 17 Jesus knew what they were saying, so he said, “Why are you arguing about having no bread? Don’t you know or understand even yet? Are your hearts too hard to take it in? 18 ‘You have eyes—can’t you see? You have ears—can’t you hear?’[a] Don’t you remember anything at all? 19 When I fed the 5,000 with five loaves of bread, how many baskets of leftovers did you pick up afterward?”\n\n“Twelve,” they said.\n\n20 “And when I fed the 4,000 with seven loaves, how many large baskets of leftovers did you pick up?”\n\n“Seven,” they said.\n\n21 “Don’t you understand yet?” he asked them.",
    "date": "2025-03-31T09:26:27+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/cFumKRKKmr4/maxresdefault.webp",
    "video_id": "cFumKRKKmr4",
    "timestamp": 1743413187
  },
  {
    "title": "Mark | What Defiles a Person?",
    "description": "Mark 7:1-23 \nOne day some Pharisees and teachers of religious law arrived from Jerusalem to see Jesus. 2 They noticed that some of his disciples failed to follow the Jewish ritual of hand washing before eating. 3 (The Jews, especially the Pharisees, do not eat until they have poured water over their cupped hands, as required by their ancient traditions. 4 Similarly, they don’t eat anything from the market until they immerse their hands in water. This is but one of many traditions they have clung to—such as their ceremonial washing of cups, pitchers, and kettles.)\n\n5 So the Pharisees and teachers of religious law asked him, “Why don’t your disciples follow our age-old tradition? They eat without first performing the hand-washing ceremony.”\n\n6 Jesus replied, “You hypocrites! Isaiah was right when he prophesied about you, for he wrote,\n\n‘These people honor me with their lips,\n    but their hearts are far from me.\n7 Their worship is a farce,\n    for they teach man-made ideas as commands from God.’\n8 For you ignore God’s law and substitute your own tradition.”\n\n9 Then he said, “You skillfully sidestep God’s law in order to hold on to your own tradition. 10 For instance, Moses gave you this law from God: ‘Honor your father and mother,’ and ‘Anyone who speaks disrespectfully of father or mother must be put to death.’ 11 But you say it is all right for people to say to their parents, ‘Sorry, I can’t help you. For I have vowed to give to God what I would have given to you.’ 12 In this way, you let them disregard their needy parents. 13 And so you cancel the word of God in order to hand down your own tradition. And this is only one example among many others.”\n\n14 Then Jesus called to the crowd to come and hear. “All of you listen,” he said, “and try to understand. 15 It’s not what goes into your body that defiles you; you are defiled by what comes from your heart.”\n\n17 Then Jesus went into a house to get away from the crowd, and his disciples asked him what he meant by the parable he had just used. 18 “Don’t you understand either?” he asked. “Can’t you see that the food you put into your body cannot defile you? 19 Food doesn’t go into your heart, but only passes through the stomach and then goes into the sewer.” (By saying this, he declared that every kind of food is acceptable in God’s eyes.)\n\n20 And then he added, “It is what comes from inside that defiles you. 21 For from within, out of a person’s heart, come evil thoughts, sexual immorality, theft, murder, 22 adultery, greed, wickedness, deceit, lustful desires, envy, slander, pride, and foolishness. 23 All these vile things come from within; they are what defile you.”",
    "date": "2025-03-17T09:27:51+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/WaQsK4OhyeA/maxresdefault.webp",
    "video_id": "WaQsK4OhyeA",
    "timestamp": 1742203671
  },
  {
    "title": "Mark | Walking on Water",
    "description": "Mark 6:45-56\n45 Immediately after this, Jesus insisted that his disciples get back into the boat and head across the lake to Bethsaida, while he sent the people home. 46 After telling everyone good-bye, he went up into the hills by himself to pray.\n\n47 Late that night, the disciples were in their boat in the middle of the lake, and Jesus was alone on land. 48 He saw that they were in serious trouble, rowing hard and struggling against the wind and waves. About three o’clock in the morning[i] Jesus came toward them, walking on the water. He intended to go past them, 49 but when they saw him walking on the water, they cried out in terror, thinking he was a ghost. 50 They were all terrified when they saw him.\n\nBut Jesus spoke to them at once. “Don’t be afraid,” he said. “Take courage! I am here!” 51 Then he climbed into the boat, and the wind stopped. They were totally amazed, 52 for they still didn’t understand the significance of the miracle of the loaves. Their hearts were too hard to take it in.\n\n53 After they had crossed the lake, they landed at Gennesaret. They brought the boat to shore 54 and climbed out. The people recognized Jesus at once, 55 and they ran throughout the whole area, carrying sick people on mats to wherever they heard he was. 56 Wherever he went—in villages, cities, or the countryside—they brought the sick out to the marketplaces. They begged him to let the sick touch at least the fringe of his robe, and all who touched him were healed.",
    "date": "2025-03-10T09:38:41+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/TPAGdUw5_6E/maxresdefault.webp",
    "video_id": "TPAGdUw5_6E",
    "timestamp": 1741599521
  },
  {
    "title": "Mark | Jesus Feeds the 5000",
    "description": "Mark 6:30-44",
    "date": "2025-03-03T09:24:50+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/J9kMcKFnVlY/maxresdefault.webp",
    "video_id": "J9kMcKFnVlY",
    "timestamp": 1740993890
  },
  {
    "title": "Mark | The Kingdom of Heaven Goes Forth",
    "description": "Mark 6:1-29",
    "date": "2025-02-24T09:29:30+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/5-CEYiEOrb8/maxresdefault.webp",
    "video_id": "5-CEYiEOrb8",
    "timestamp": 1740389370
  },
  {
    "title": "Mark | Faith to Heal",
    "description": "Mark 5:21-43 \n21 Jesus got into the boat again and went back to the other side of the lake, where a large crowd gathered around him on the shore. 22 Then a leader of the local synagogue, whose name was Jairus, arrived. When he saw Jesus, he fell at his feet, 23 pleading fervently with him. “My little daughter is dying,” he said. “Please come and lay your hands on her; heal her so she can live.”\n\n24 Jesus went with him, and all the people followed, crowding around him. 25 A woman in the crowd had suffered for twelve years with constant bleeding. 26 She had suffered a great deal from many doctors, and over the years she had spent everything she had to pay them, but she had gotten no better. In fact, she had gotten worse. 27 She had heard about Jesus, so she came up behind him through the crowd and touched his robe. 28 For she thought to herself, “If I can just touch his robe, I will be healed.” 29 Immediately the bleeding stopped, and she could feel in her body that she had been healed of her terrible condition.\n\n30 Jesus realized at once that healing power had gone out from him, so he turned around in the crowd and asked, “Who touched my robe?”\n\n31 His disciples said to him, “Look at this crowd pressing around you. How can you ask, ‘Who touched me?’”\n\n32 But he kept on looking around to see who had done it. 33 Then the frightened woman, trembling at the realization of what had happened to her, came and fell to her knees in front of him and told him what she had done. 34 And he said to her, “Daughter, your faith has made you well. Go in peace. Your suffering is over.”\n\n35 While he was still speaking to her, messengers arrived from the home of Jairus, the leader of the synagogue. They told him, “Your daughter is dead. There’s no use troubling the Teacher now.”\n\n36 But Jesus overheard[d] them and said to Jairus, “Don’t be afraid. Just have faith.”\n\n37 Then Jesus stopped the crowd and wouldn’t let anyone go with him except Peter, James, and John (the brother of James). 38 When they came to the home of the synagogue leader, Jesus saw much commotion and weeping and wailing. 39 He went inside and asked, “Why all this commotion and weeping? The child isn’t dead; she’s only asleep.”\n\n40 The crowd laughed at him. But he made them all leave, and he took the girl’s father and mother and his three disciples into the room where the girl was lying. 41 Holding her hand, he said to her, “Talitha koum,” which means “Little girl, get up!” 42 And the girl, who was twelve years old, immediately stood up and walked around! They were overwhelmed and totally amazed. 43 Jesus gave them strict orders not to tell anyone what had happened, and then he told them to give her something to eat.",
    "date": "2025-02-17T09:20:43+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/S4VWYcSflq8/maxresdefault.webp",
    "video_id": "S4VWYcSflq8",
    "timestamp": 1739784043
  },
  {
    "title": "Mark | Jesus & the Legion of Doom",
    "description": "",
    "date": "2025-02-10T09:47:34+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/onPhWB-CvAw/maxresdefault.webp",
    "video_id": "onPhWB-CvAw",
    "timestamp": 1739180854
  },
  {
    "title": "Mark | Jesus Calms the Storm",
    "description": "",
    "date": "2025-01-27T09:30:30+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/d_rZNBZsa20/maxresdefault.webp",
    "video_id": "d_rZNBZsa20",
    "timestamp": 1737970230
  },
  {
    "title": "Mark | Living Parables",
    "description": "",
    "date": "2025-01-20T09:39:39+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/omAtuNQwL64/maxresdefault.webp",
    "video_id": "omAtuNQwL64",
    "timestamp": 1737365979
  },
  {
    "title": "Mark | Jesus Speaks in Parables",
    "description": "Mark 4:1-20",
    "date": "2025-01-13T09:40:12+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/fANPNt_Bq4w/maxresdefault.webp",
    "video_id": "fANPNt_Bq4w",
    "timestamp": 1736761212
  },
  {
    "title": "Mark | Defeating the Strong Man",
    "description": "Mark 3:20-35\n20 One time Jesus entered a house, and the crowds began to gather again. Soon he and his disciples couldn’t even find time to eat. 21 When his family heard what was happening, they tried to take him away. “He’s out of his mind,” they said.\n\n22 But the teachers of religious law who had arrived from Jerusalem said, “He’s possessed by Satan,[a] the prince of demons. That’s where he gets the power to cast out demons.”\n\n23 Jesus called them over and responded with an illustration. “How can Satan cast out Satan?” he asked. 24 “A kingdom divided by civil war will collapse. 25 Similarly, a family splintered by feuding will fall apart. 26 And if Satan is divided and fights against himself, how can he stand? He would never survive. 27 Let me illustrate this further. Who is powerful enough to enter the house of a strong man and plunder his goods? Only someone even stronger—someone who could tie him up and then plunder his house.\n\n28 “I tell you the truth, all sin and blasphemy can be forgiven, 29 but anyone who blasphemes the Holy Spirit will never be forgiven. This is a sin with eternal consequences.” 30 He told them this because they were saying, “He’s possessed by an evil spirit.”\n\n\n31 Then Jesus’ mother and brothers came to see him. They stood outside and sent word for him to come out and talk with them. 32 There was a crowd sitting around Jesus, and someone said, “Your mother and your brothers[b] are outside asking for you.”\n\n33 Jesus replied, “Who is my mother? Who are my brothers?” 34 Then he looked at those around him and said, “Look, these are my mother and brothers. 35 Anyone who does God’s will is my brother and sister and mother.”",
    "date": "2025-01-06T09:51:32+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/rng5wvAZRgQ/maxresdefault.webp",
    "video_id": "rng5wvAZRgQ",
    "timestamp": 1736157092
  },
  {
    "title": "An Every Member Kingdom | Mark 3.1-19",
    "description": "Mark 3:1-19 \nJesus went into the synagogue again and noticed a man with a deformed hand. 2 Since it was the Sabbath, Jesus’ enemies watched him closely. If he healed the man’s hand, they planned to accuse him of working on the Sabbath.\n3 Jesus said to the man with the deformed hand, “Come and stand in front of everyone.” 4 Then he turned to his critics and asked, “Does the law permit good deeds on the Sabbath, or is it a day for doing evil? Is this a day to save life or to destroy it?” But they wouldn’t answer him.\n5 He looked around at them angrily and was deeply saddened by their hard hearts. Then he said to the man, “Hold out your hand.” So the man held out his hand, and it was restored! 6 At once the Pharisees went away and met with the supporters of Herod to plot how to kill Jesus.\n\n\n7 Jesus went out to the lake with his disciples, and a large crowd followed him. They came from all over Galilee, Judea, 8 Jerusalem, Idumea, from east of the Jordan River, and even from as far north as Tyre and Sidon. The news about his miracles had spread far and wide, and vast numbers of people came to see him.\n9 Jesus instructed his disciples to have a boat ready so the crowd would not crush him. 10 He had healed many people that day, so all the sick people eagerly pushed forward to touch him. 11 And whenever those possessed by evil[a] spirits caught sight of him, the spirits would throw them to the ground in front of him shrieking, “You are the Son of God!” 12 But Jesus sternly commanded the spirits not to reveal who he was.\n\n\n13 Afterward Jesus went up on a mountain and called out the ones he wanted to go with him. And they came to him. 14 Then he appointed twelve of them and called them his apostles.[b] They were to accompany him, and he would send them out to preach, 15 giving them authority to cast out demons. 16 These are the twelve he chose:\nSimon (whom he named Peter),\n17 James and John (the sons of Zebedee, but Jesus nicknamed them “Sons of Thunder”[c]),\n18 Andrew,\nPhilip,\nBartholomew,\nMatthew,\nThomas,\nJames (son of Alphaeus),\nThaddaeus,\nSimon (the zealot[d]),\n19 Judas Iscariot (who later betrayed him).",
    "date": "2024-11-18T09:43:39+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/5_a0RxoiQQ4/maxresdefault.webp",
    "video_id": "5_a0RxoiQQ4",
    "timestamp": 1731923019
  },
  {
    "title": "Fasting & the Sabbath | Mark 2:18-28",
    "description": "Mark 2:18-28 \n18 Once when John’s disciples and the Pharisees were fasting, some people came to Jesus and asked, “Why don’t your disciples fast like John’s disciples and the Pharisees do?”\n19 Jesus replied, “Do wedding guests fast while celebrating with the groom? Of course not. They can’t fast while the groom is with them. 20 But someday the groom will be taken away from them, and then they will fast.\n21 “Besides, who would patch old clothing with new cloth? For the new patch would shrink and rip away from the old cloth, leaving an even bigger tear than before.\n22 “And no one puts new wine into old wineskins. For the wine would burst the wineskins, and the wine and the skins would both be lost. New wine calls for new wineskins.”\n\n23 One Sabbath day as Jesus was walking through some grainfields, his disciples began breaking off heads of grain to eat. 24 But the Pharisees said to Jesus, “Look, why are they breaking the law by harvesting grain on the Sabbath?”\n25 Jesus said to them, “Haven’t you ever read in the Scriptures what David did when he and his companions were hungry? 26 He went into the house of God (during the days when Abiathar was high priest) and broke the law by eating the sacred loaves of bread that only the priests are allowed to eat. He also gave some to his companions.”\n27 Then Jesus said to them, “The Sabbath was made to meet the needs of people, and not people to meet the requirements of the Sabbath. 28 So the Son of Man is Lord, even over the Sabbath!”",
    "date": "2024-11-11T09:37:32+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/BtExqvt5Z0c/maxresdefault.webp",
    "video_id": "BtExqvt5Z0c",
    "timestamp": 1731317852
  },
  {
    "title": "Dining with Sinners | Mark 2: 13-17",
    "description": "Mark 2-13-17 \n13 Once again Jesus went out beside the lake. A large crowd came to him, and he began to teach them. 14 As he walked along, he saw Levi son of Alphaeus sitting at the tax collector’s booth. “Follow me,” Jesus told him, and Levi got up and followed him.\n\n15 While Jesus was having dinner at Levi’s house, many tax collectors and sinners were eating with him and his disciples, for there were many who followed him. 16 When the teachers of the law who were Pharisees saw him eating with the sinners and tax collectors, they asked his disciples: “Why does he eat with tax collectors and sinners?”\n\n17 On hearing this, Jesus said to them, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners.”",
    "date": "2024-11-04T09:42:35+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/jf8AymDcB1o/maxresdefault.webp",
    "video_id": "jf8AymDcB1o",
    "timestamp": 1730713355
  },
  {
    "title": "The Persistence of Friends | Mark 2:1-12",
    "description": "Mark 2:1-12\nA few days later, when Jesus again entered Capernaum, the people heard that he had come home. 2 They gathered in such large numbers that there was no room left, not even outside the door, and he preached the word to them. 3 Some men came, bringing to him a paralyzed man, carried by four of them. 4 Since they could not get him to Jesus because of the crowd, they made an opening in the roof above Jesus by digging through it and then lowered the mat the man was lying on. 5 When Jesus saw their faith, he said to the paralyzed man, “Son, your sins are forgiven.”\n\n6 Now some teachers of the law were sitting there, thinking to themselves, 7 “Why does this fellow talk like that? He’s blaspheming! Who can forgive sins but God alone?”\n\n8 Immediately Jesus knew in his spirit that this was what they were thinking in their hearts, and he said to them, “Why are you thinking these things? 9 Which is easier: to say to this paralyzed man, ‘Your sins are forgiven,’ or to say, ‘Get up, take your mat and walk’? 10 But I want you to know that the Son of Man has authority on earth to forgive sins.” So he said to the man, 11 “I tell you, get up, take your mat and go home.” 12 He got up, took his mat and walked out in full view of them all. This amazed everyone and they praised God, saying, “We have never seen anything like this!”",
    "date": "2024-10-28T09:27:13+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/LWPtO9UXkco/maxresdefault.webp",
    "video_id": "LWPtO9UXkco",
    "timestamp": 1730107633
  },
  {
    "title": "Loving the Unlovable | Mark 1:40-45",
    "description": "",
    "date": "2024-10-21T09:36:53+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/TlWEQh-D2Cs/maxresdefault.webp",
    "video_id": "TlWEQh-D2Cs",
    "timestamp": 1729503413
  },
  {
    "title": "Power Over Darkness & Disease | Mark 1:21-39",
    "description": "",
    "date": "2024-10-14T09:28:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/-qz3pDzQ6Vo/maxresdefault.webp",
    "video_id": "-qz3pDzQ6Vo",
    "timestamp": 1728898101
  },
  {
    "title": "Come Follow Me | Mark 1:16-20",
    "description": "",
    "date": "2024-09-30T09:23:44+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/g49Bc2rKnCk/maxresdefault.webp",
    "video_id": "g49Bc2rKnCk",
    "timestamp": 1727688224
  },
  {
    "title": "The Kingdom of God has Come | Mark 1:14-15",
    "description": "",
    "date": "2024-09-23T09:27:00+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/x_9XMaMzRy8/maxresdefault.webp",
    "video_id": "x_9XMaMzRy8",
    "timestamp": 1727083620
  },
  {
    "title": "Who do you Say that I Am? | Mark 1:9-13",
    "description": "Mark 1:9-13 \n9 At that time Jesus came from Nazareth in Galilee and was baptized by John in the Jordan. 10 Just as Jesus was coming up out of the water, he saw heaven being torn open and the Spirit descending on him like a dove. 11 And a voice came from heaven: “You are my Son, whom I love; with you I am well pleased.”\n\n12 At once the Spirit sent him out into the wilderness, 13 and he was in the wilderness forty days, being tempted by Satan. He was with the wild animals, and angels attended him.",
    "date": "2024-09-16T09:26:15+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/i4hZCJdK3C4/maxresdefault.webp",
    "video_id": "i4hZCJdK3C4",
    "timestamp": 1726478775
  },
  {
    "title": "Forerunners of Christ | Mark 1:2-8",
    "description": "2...as it is written in Isaiah the prophet:\n“I will send my messenger ahead of you,\n    who will prepare your way”—\n3 “a voice of one calling in the wilderness,\n‘Prepare the way for the Lord,\n    make straight paths for him.’”\n4 And so John the Baptist appeared in the wilderness, preaching a baptism of repentance for the forgiveness of sins. 5 The whole Judean countryside and all the people of Jerusalem went out to him. Confessing their sins, they were baptized by him in the Jordan River. 6 John wore clothing made of camel’s hair, with a leather belt around his waist, and he ate locusts and wild honey. 7 And this was his message: “After me comes the one more powerful than I, the straps of whose sandals I am not worthy to stoop down and untie. 8 I baptize you with water, but he will baptize you with the Holy Spirit.”",
    "date": "2024-09-09T09:31:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/UEvJoBgm6ms/maxresdefault.webp",
    "video_id": "UEvJoBgm6ms",
    "timestamp": 1725874281
  },
  {
    "title": "The Good News of Jesus the Messiah | Mark 1:1",
    "description": "",
    "date": "2024-09-02T09:14:59+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/OCyikP6QXZU/maxresdefault.webp",
    "video_id": "OCyikP6QXZU",
    "timestamp": 1725268499
  }
]