[
  {
    "title": "Handle With Care: Faithful Stewards of God's Word | 2 Timothy 2:14-19",
    "description": "Keep reminding God’s people of these things. Warn them before God against quarreling about words; it is of no value, and only ruins those who listen. Do your best to present yourself to God as one approved, a worker who does not need to be ashamed and who correctly handles the word of truth. Avoid godless chatter, because those who indulge in it will become more and more ungodly. Their teaching will spread like gangrene. Among them are Hymenaeus and Philetus, who have departed from the truth. They say that the resurrection has already taken place, and they destroy the faith of some. Nevertheless, God’s solid foundation stands firm, sealed with this inscription: “The Lord knows those who are his,” and, “Everyone who confesses the name of the Lord must turn away from wickedness.”",
    "date": "2026-02-16T09:47:44+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/O_5vrfGz0tg/maxresdefault.webp",
    "video_id": "O_5vrfGz0tg",
    "timestamp": 1771235264
  },
  {
    "title": "Remember Jesus: Faithfulness When the Cost Is High | 2 Timothy 2:8-13",
    "description": "Remember Jesus Christ, raised from the dead, descended from David. This is my gospel, for which I am suffering even to the point of being chained like a criminal. But God’s word is not chained. Therefore I endure everything for the sake of the elect, that they too may obtain the salvation that is in Christ Jesus, with eternal glory.\n\nHere is a trustworthy saying:\n\nIf we died with him,\n    we will also live with him;\nif we endure,\n    we will also reign with him.\nIf we disown him,\n    he will also disown us;\nif we are faithless,\n    he remains faithful,\n    for he cannot disown himself.",
    "date": "2026-02-09T10:05:02+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/09NCIj0ztGI/maxresdefault.webp",
    "video_id": "09NCIj0ztGI",
    "timestamp": 1770631502
  },
  {
    "title": "Strength for Long Obedience | 2 Timothy 2:1-7",
    "description": "You then, my son, be strong in the grace that is in Christ Jesus. And the things you have heard me say in the presence of many witnesses entrust to reliable people who will also be qualified to teach others. Join with me in suffering, like a good soldier of Christ Jesus. No one serving as a soldier gets entangled in civilian affairs, but rather tries to please his commanding officer. Similarly, anyone who competes as an athlete does not receive the victor’s crown except by competing according to the rules. The hardworking farmer should be the first to receive a share of the crops. Reflect on what I am saying, for the Lord will give you insight into all this.",
    "date": "2026-02-02T09:36:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/PcTog4ynbIs/maxresdefault.webp",
    "video_id": "PcTog4ynbIs",
    "timestamp": 1770024981
  },
  {
    "title": "Unashamed When Others Walk Away | 2 Timothy 1:7–18",
    "description": "For the Spirit God gave us does not make us timid, but gives us power, love and self-discipline. So do not be ashamed of the testimony about our Lord or of me his prisoner. Rather, join with me in suffering for the gospel, by the power of God. He has saved us and called us to a holy life—not because of anything we have done but because of his own purpose and grace. This grace was given us in Christ Jesus before the beginning of time, but it has now been revealed through the appearing of our Savior, Christ Jesus, who has destroyed death and has brought life and immortality to light through the gospel. And of this gospel I was appointed a herald and an apostle and a teacher. That is why I am suffering as I am. Yet this is no cause for shame, because I know whom I have believed, and am convinced that he is able to guard what I have entrusted to him until that day.\n\nWhat you heard from me, keep as the pattern of sound teaching, with faith and love in Christ Jesus. Guard the good deposit that was entrusted to you—guard it with the help of the Holy Spirit who lives in us.\n\nYou know that everyone in the province of Asia has deserted me, including Phygelus and Hermogenes.\n\nMay the Lord show mercy to the household of Onesiphorus, because he often refreshed me and was not ashamed of my chains. On the contrary, when he was in Rome, he searched hard for me until he found me. May the Lord grant that he will find mercy from the Lord on that day! You know very well in how many ways he helped me in Ephesus.",
    "date": "2026-01-26T09:38:48+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/5kskNIMGOfU/maxresdefault.webp",
    "video_id": "5kskNIMGOfU",
    "timestamp": 1769420328
  },
  {
    "title": "A Faith That Endures  |  2 Timothy 1:3-6",
    "description": "I thank God, whom I serve, as my ancestors did, with a clear conscience, as night and day I constantly remember you in my prayers. Recalling your tears, I long to see you, so that I may be filled with joy. I am reminded of your sincere faith, which first lived in your grandmother Lois and in your mother Eunice and, I am persuaded, now lives in you also.\nFor this reason I remind you to fan into flame the gift of God, which is in you through the laying on of my hands.",
    "date": "2026-01-19T09:49:55+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/6Nc16mHlVBg/maxresdefault.webp",
    "video_id": "6Nc16mHlVBg",
    "timestamp": 1768816195
  },
  {
    "title": "Finish Faithful | 2 Timothy 1:1-2",
    "description": "2 Timothy 1:1-2\n\nPaul, an apostle of Christ Jesus by the will of God, in keeping with the promise of life that is in Christ Jesus,\nTo Timothy, my dear son:\nGrace, mercy and peace from God the Father and Christ Jesus our Lord.",
    "date": "2026-01-12T10:04:38+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/FI3Mq6fkmFI/maxresdefault.webp",
    "video_id": "FI3Mq6fkmFI",
    "timestamp": 1768212278
  },
  {
    "title": "Choosing the Good Portion | Luke 10:38-42",
    "description": "As Jesus and his disciples were on their way, he came to a village where a woman named Martha opened her home to him. She had a sister called Mary, who sat at the Lord’s feet listening to what he said. But Martha was distracted by all the preparations that had to be made. She came to him and asked, “Lord, don’t you care that my sister has left me to do the work by myself? Tell her to help me!”\n\n“Martha, Martha,” the Lord answered, “you are worried and upset about many things, but few things are needed—or indeed only one. Mary has chosen what is better, and it will not be taken away from her.”",
    "date": "2026-01-05T12:05:09+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/ngTd-DiwGwk/maxresdefault.webp",
    "video_id": "ngTd-DiwGwk",
    "timestamp": 1767614709
  },
  {
    "title": "God’s Past Record is our Future Assurance | Deuteronomy 6:4-12",
    "description": "“Listen, O Israel! The Lord is our God, the Lord alone.[a]  And you must love the Lord your God with all your heart, all your soul, and all your strength.  And you must commit yourselves wholeheartedly to these commands that I am giving you today.  Repeat them again and again to your children. Talk about them when you are at home and when you are on the road, when you are going to bed and when you are getting up. Tie them to your hands and wear them on your forehead as reminders.  Write them on the doorposts of your house and on your gates…..be careful not to forget the Lord, who rescued you from slavery in the land of Egypt.",
    "date": "2025-12-29T09:57:36+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/hLGsmXRzwzA/maxresdefault.webp",
    "video_id": "hLGsmXRzwzA",
    "timestamp": 1767002256
  },
  {
    "title": "Advent | Joy to the World | Luke 2:8–11",
    "description": "Luke 2:8–11\nAt that time the Roman emperor, Augustus, decreed that a census should be taken throughout the\nRoman Empire. 2 (This was the first census taken when Quirinius was governor of Syria.) 3 All returned to\ntheir own ancestral towns to register for this census. 4 And because Joseph was a descendant of King\nDavid, he had to go to Bethlehem in Judea, David’s ancient home. He traveled there from the village of\nNazareth in Galilee. 5 He took with him Mary, to whom he was engaged, who was now expecting a child.\n3\n6 And while they were there, the time came for her baby to be born. 7 She gave birth to her firstborn son.\nShe wrapped him snugly in strips of cloth and laid him in a manger, because there was no lodging\navailable for them.\n8 That night there were shepherds staying in the fields nearby, guarding their flocks of sheep. 9 Suddenly,\nan angel of the Lord appeared among them, and the radiance of the Lord’s glory surrounded them. They\nwere terrified, 10 but the angel reassured them. “Don’t be afraid!” he said. “I bring you good news that\nwill bring great joy to all people. 11 The Savior—yes, the Messiah, the Lord—has been born today in\nBethlehem, the city of David!12 And you will rec",
    "date": "2025-12-22T09:32:09+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/r8H5agdyZOk/maxresdefault.webp",
    "video_id": "r8H5agdyZOk",
    "timestamp": 1766395929
  },
  {
    "title": "Peace | Advent | Luke 2:8-10",
    "description": "And there were shepherds living out in the fields nearby, keeping watch over their flocks at night. An angel of the Lord appeared to them, and the glory of the Lord shone around them, and they were terrified. But the angel said to them, “Do not be afraid. I bring you good news that will cause great joy for all the people.",
    "date": "2025-12-15T09:40:42+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/_eRaLFKdUr0/maxresdefault.webp",
    "video_id": "_eRaLFKdUr0",
    "timestamp": 1765791642
  },
  {
    "title": "Hope is Here | Advent | 1 Samuel 1:4-20",
    "description": "4 Whenever the day came for Elkanah to sacrifice, he would give portions of the meat to his wife Peninnah and to all her sons and daughters. 5 But to Hannah he gave a double portion because he loved her, and the Lord had closed her womb. 6 Because the Lord had closed Hannah’s womb, her rival kept provoking her in order to irritate her. 7 This went on year after year. Whenever Hannah went up to the house of the Lord, her rival provoked her till she wept and would not eat. 8 Her husband Elkanah would say to her, “Hannah, why are you weeping? Why don’t you eat? Why are you downhearted? Don’t I mean more to you than ten sons?”\n\n9 Once when they had finished eating and drinking in Shiloh, Hannah stood up. Now Eli the priest was sitting on his chair by the doorpost of the Lord’s house. 10 In her deep anguish Hannah prayed to the Lord, weeping bitterly. 11 And she made a vow, saying, “Lord Almighty, if you will only look on your servant’s misery and remember me, and not forget your servant but give her a son, then I will give him to the Lord for all the days of his life, and no razor will ever be used on his head.”\n\n12 As she kept on praying to the Lord, Eli observed her mouth. 13 Hannah was praying in her heart, and her lips were moving but her voice was not heard. Eli thought she was drunk 14 and said to her, “How long are you going to stay drunk? Put away your wine.”\n\n15 “Not so, my lord,” Hannah replied, “I am a woman who is deeply troubled. I have not been drinking wine or beer; I was pouring out my soul to the Lord. 16 Do not take your servant for a wicked woman; I have been praying here out of my great anguish and grief.”\n\n17 Eli answered, “Go in peace, and may the God of Israel grant you what you have asked of him.”\n\n18 She said, “May your servant find favor in your eyes.” Then she went her way and ate something, and her face was no longer downcast.\n\n19 Early the next morning they arose and worshiped before the Lord and then went back to their home at Ramah. Elkanah made love to his wife Hannah, and the Lord remembered her. 20 So in the course of time Hannah became pregnant and gave birth to a son. She named him Samuel,[a] saying, “Because I asked the Lord for him.”",
    "date": "2025-12-08T09:49:33+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/AWoBm4E3W2c/maxresdefault.webp",
    "video_id": "AWoBm4E3W2c",
    "timestamp": 1765187373
  },
  {
    "title": "With Thanksgiving: The Path From Anxiety to Peace | Philippians 4:6-7",
    "description": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
    "date": "2025-11-24T18:02:23+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/ZTA5pmuY0k0/maxresdefault.webp",
    "video_id": "ZTA5pmuY0k0",
    "timestamp": 1764007343
  },
  {
    "title": "The Resurrected Christ | Mark 16:1-20",
    "description": "When the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices so that they might go to anoint Jesus’ body. Very early on the first day of the week, just after sunrise, they were on their way to the tomb and they asked each other, “Who will roll the stone away from the entrance of the tomb?”\n\nBut when they looked up, they saw that the stone, which was very large, had been rolled away. As they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed.\n\n“Don’t be alarmed,” he said. “You are looking for Jesus the Nazarene, who was crucified. He has risen! He is not here. See the place where they laid him. But go, tell his disciples and Peter, ‘He is going ahead of you into Galilee. There you will see him, just as he told you.’”\n\nTrembling and bewildered, the women went out and fled from the tomb. They said nothing to anyone, because they were afraid.",
    "date": "2025-11-17T09:36:08+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/9oUXz96bPRE/maxresdefault.webp",
    "video_id": "9oUXz96bPRE",
    "timestamp": 1763372168
  },
  {
    "title": "The Tomb | Mark 15:42-47",
    "description": "The Burial of Jesus\nIt was Preparation Day (that is, the day before the Sabbath). So as evening approached, Joseph of Arimathea, a prominent member of the Council, who was himself waiting for the kingdom of God, went boldly to Pilate and asked for Jesus’ body. Pilate was surprised to hear that he was already dead. Summoning the centurion, he asked him if Jesus had already died. When he learned from the centurion that it was so, he gave the body to Joseph. So Joseph bought some linen cloth, took down the body, wrapped it in the linen, and placed it in a tomb cut out of rock. Then he rolled a stone against the entrance of the tomb. Mary Magdalene and Mary the mother of Joseph saw where he was laid.",
    "date": "2025-11-10T09:31:23+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/riA5NWcyHdc/maxresdefault.webp",
    "video_id": "riA5NWcyHdc",
    "timestamp": 1762767083
  },
  {
    "title": "The Cross | Mark 15:21-41",
    "description": "The Crucifixion of Jesus\nA certain man from Cyrene, Simon, the father of Alexander and Rufus, was passing by on his way in from the country, and they forced him to carry the cross. They brought Jesus to the place called Golgotha (which means “the place of the skull”). Then they offered him wine mixed with myrrh, but he did not take it. And they crucified him. Dividing up his clothes, they cast lots to see what each would get.\n\nIt was nine in the morning when they crucified him. The written notice of the charge against him read: the king of the jews.\n\nThey crucified two rebels with him, one on his right and one on his left. Those who passed by hurled insults at him, shaking their heads and saying, “So! You who are going to destroy the temple and build it in three days, come down from the cross and save yourself!” In the same way the chief priests and the teachers of the law mocked him among themselves. “He saved others,” they said, “but he can’t save himself! Let this Messiah, this king of Israel, come down now from the cross, that we may see and believe.” Those crucified with him also heaped insults on him.\n\nThe Death of Jesus\nAt noon, darkness came over the whole land until three in the afternoon. And at three in the afternoon Jesus cried out in a loud voice, “Eloi, Eloi, lema sabachthani?” (which means “My God, my God, why have you forsaken me?”).\n\nWhen some of those standing near heard this, they said, “Listen, he’s calling Elijah.”\n\nSomeone ran, filled a sponge with wine vinegar, put it on a staff, and offered it to Jesus to drink. “Now leave him alone. Let’s see if Elijah comes to take him down,” he said.\n\nWith a loud cry, Jesus breathed his last.\n\nThe curtain of the temple was torn in two from top to bottom. And when the centurion, who stood there in front of Jesus, saw how he died, he said, “Surely this man was the Son of God!”\n\nSome women were watching from a distance. Among them were Mary Magdalene, Mary the mother of James the younger and of Joseph, and Salome. In Galilee these women had followed him and cared for his needs. Many other women who had come up with him to Jerusalem were also there.",
    "date": "2025-11-03T09:40:37+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/X9SVLebiF3M/maxresdefault.webp",
    "video_id": "X9SVLebiF3M",
    "timestamp": 1762162837
  }
]