[
  {
    "title": "Advent '24 | Peace",
    "description": "",
    "date": "2024-12-09T09:40:55+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/3Oav5or0nB4/maxresdefault.webp",
    "video_id": "3Oav5or0nB4",
    "timestamp": 1733737255
  },
  {
    "title": "Advent '24 | Hope",
    "description": "",
    "date": "2024-12-02T09:26:38+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/4aKQqiwE5sQ/maxresdefault.webp",
    "video_id": "4aKQqiwE5sQ",
    "timestamp": 1733131598
  },
  {
    "title": "Contemplative Prayer",
    "description": "",
    "date": "2024-11-25T09:27:18+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/1lHsrMCBGN0/maxresdefault.webp",
    "video_id": "1lHsrMCBGN0",
    "timestamp": 1732526838
  },
  {
    "title": "An Every Member Kingdom | Mark 3.1-19",
    "description": "Mark 3:1-19 \nJesus went into the synagogue again and noticed a man with a deformed hand. 2 Since it was the Sabbath, Jesus’ enemies watched him closely. If he healed the man’s hand, they planned to accuse him of working on the Sabbath.\n3 Jesus said to the man with the deformed hand, “Come and stand in front of everyone.” 4 Then he turned to his critics and asked, “Does the law permit good deeds on the Sabbath, or is it a day for doing evil? Is this a day to save life or to destroy it?” But they wouldn’t answer him.\n5 He looked around at them angrily and was deeply saddened by their hard hearts. Then he said to the man, “Hold out your hand.” So the man held out his hand, and it was restored! 6 At once the Pharisees went away and met with the supporters of Herod to plot how to kill Jesus.\n\n\n7 Jesus went out to the lake with his disciples, and a large crowd followed him. They came from all over Galilee, Judea, 8 Jerusalem, Idumea, from east of the Jordan River, and even from as far north as Tyre and Sidon. The news about his miracles had spread far and wide, and vast numbers of people came to see him.\n9 Jesus instructed his disciples to have a boat ready so the crowd would not crush him. 10 He had healed many people that day, so all the sick people eagerly pushed forward to touch him. 11 And whenever those possessed by evil[a] spirits caught sight of him, the spirits would throw them to the ground in front of him shrieking, “You are the Son of God!” 12 But Jesus sternly commanded the spirits not to reveal who he was.\n\n\n13 Afterward Jesus went up on a mountain and called out the ones he wanted to go with him. And they came to him. 14 Then he appointed twelve of them and called them his apostles.[b] They were to accompany him, and he would send them out to preach, 15 giving them authority to cast out demons. 16 These are the twelve he chose:\nSimon (whom he named Peter),\n17 James and John (the sons of Zebedee, but Jesus nicknamed them “Sons of Thunder”[c]),\n18 Andrew,\nPhilip,\nBartholomew,\nMatthew,\nThomas,\nJames (son of Alphaeus),\nThaddaeus,\nSimon (the zealot[d]),\n19 Judas Iscariot (who later betrayed him).",
    "date": "2024-11-18T09:43:39+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/5_a0RxoiQQ4/maxresdefault.webp",
    "video_id": "5_a0RxoiQQ4",
    "timestamp": 1731923019
  },
  {
    "title": "Fasting & the Sabbath | Mark 2:18-28",
    "description": "Mark 2:18-28 \n18 Once when John’s disciples and the Pharisees were fasting, some people came to Jesus and asked, “Why don’t your disciples fast like John’s disciples and the Pharisees do?”\n19 Jesus replied, “Do wedding guests fast while celebrating with the groom? Of course not. They can’t fast while the groom is with them. 20 But someday the groom will be taken away from them, and then they will fast.\n21 “Besides, who would patch old clothing with new cloth? For the new patch would shrink and rip away from the old cloth, leaving an even bigger tear than before.\n22 “And no one puts new wine into old wineskins. For the wine would burst the wineskins, and the wine and the skins would both be lost. New wine calls for new wineskins.”\n\n23 One Sabbath day as Jesus was walking through some grainfields, his disciples began breaking off heads of grain to eat. 24 But the Pharisees said to Jesus, “Look, why are they breaking the law by harvesting grain on the Sabbath?”\n25 Jesus said to them, “Haven’t you ever read in the Scriptures what David did when he and his companions were hungry? 26 He went into the house of God (during the days when Abiathar was high priest) and broke the law by eating the sacred loaves of bread that only the priests are allowed to eat. He also gave some to his companions.”\n27 Then Jesus said to them, “The Sabbath was made to meet the needs of people, and not people to meet the requirements of the Sabbath. 28 So the Son of Man is Lord, even over the Sabbath!”",
    "date": "2024-11-11T09:37:32+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/BtExqvt5Z0c/maxresdefault.webp",
    "video_id": "BtExqvt5Z0c",
    "timestamp": 1731317852
  },
  {
    "title": "Dining with Sinners | Mark 2: 13-17",
    "description": "Mark 2-13-17 \n13 Once again Jesus went out beside the lake. A large crowd came to him, and he began to teach them. 14 As he walked along, he saw Levi son of Alphaeus sitting at the tax collector’s booth. “Follow me,” Jesus told him, and Levi got up and followed him.\n\n15 While Jesus was having dinner at Levi’s house, many tax collectors and sinners were eating with him and his disciples, for there were many who followed him. 16 When the teachers of the law who were Pharisees saw him eating with the sinners and tax collectors, they asked his disciples: “Why does he eat with tax collectors and sinners?”\n\n17 On hearing this, Jesus said to them, “It is not the healthy who need a doctor, but the sick. I have not come to call the righteous, but sinners.”",
    "date": "2024-11-04T09:42:35+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/jf8AymDcB1o/maxresdefault.webp",
    "video_id": "jf8AymDcB1o",
    "timestamp": 1730713355
  },
  {
    "title": "The Persistence of Friends | Mark 2:1-12",
    "description": "Mark 2:1-12\nA few days later, when Jesus again entered Capernaum, the people heard that he had come home. 2 They gathered in such large numbers that there was no room left, not even outside the door, and he preached the word to them. 3 Some men came, bringing to him a paralyzed man, carried by four of them. 4 Since they could not get him to Jesus because of the crowd, they made an opening in the roof above Jesus by digging through it and then lowered the mat the man was lying on. 5 When Jesus saw their faith, he said to the paralyzed man, “Son, your sins are forgiven.”\n\n6 Now some teachers of the law were sitting there, thinking to themselves, 7 “Why does this fellow talk like that? He’s blaspheming! Who can forgive sins but God alone?”\n\n8 Immediately Jesus knew in his spirit that this was what they were thinking in their hearts, and he said to them, “Why are you thinking these things? 9 Which is easier: to say to this paralyzed man, ‘Your sins are forgiven,’ or to say, ‘Get up, take your mat and walk’? 10 But I want you to know that the Son of Man has authority on earth to forgive sins.” So he said to the man, 11 “I tell you, get up, take your mat and go home.” 12 He got up, took his mat and walked out in full view of them all. This amazed everyone and they praised God, saying, “We have never seen anything like this!”",
    "date": "2024-10-28T09:27:13+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/LWPtO9UXkco/maxresdefault.webp",
    "video_id": "LWPtO9UXkco",
    "timestamp": 1730107633
  },
  {
    "title": "Loving the Unlovable | Mark 1:40-45",
    "description": "",
    "date": "2024-10-21T09:36:53+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/TlWEQh-D2Cs/maxresdefault.webp",
    "video_id": "TlWEQh-D2Cs",
    "timestamp": 1729503413
  },
  {
    "title": "Power Over Darkness & Disease | Mark 1:21-39",
    "description": "",
    "date": "2024-10-14T09:28:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/-qz3pDzQ6Vo/maxresdefault.webp",
    "video_id": "-qz3pDzQ6Vo",
    "timestamp": 1728898101
  },
  {
    "title": "7 Year Anniversary Celebration",
    "description": "",
    "date": "2024-10-07T09:21:26+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/INk3lTBhuMs/maxresdefault.webp",
    "video_id": "INk3lTBhuMs",
    "timestamp": 1728292886
  },
  {
    "title": "Come Follow Me | Mark 1:16-20",
    "description": "",
    "date": "2024-09-30T09:23:44+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/g49Bc2rKnCk/maxresdefault.webp",
    "video_id": "g49Bc2rKnCk",
    "timestamp": 1727688224
  },
  {
    "title": "The Kingdom of God has Come | Mark 1:14-15",
    "description": "",
    "date": "2024-09-23T09:27:00+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/x_9XMaMzRy8/maxresdefault.webp",
    "video_id": "x_9XMaMzRy8",
    "timestamp": 1727083620
  },
  {
    "title": "Who do you Say that I Am? | Mark 1:9-13",
    "description": "Mark 1:9-13 \n9 At that time Jesus came from Nazareth in Galilee and was baptized by John in the Jordan. 10 Just as Jesus was coming up out of the water, he saw heaven being torn open and the Spirit descending on him like a dove. 11 And a voice came from heaven: “You are my Son, whom I love; with you I am well pleased.”\n\n12 At once the Spirit sent him out into the wilderness, 13 and he was in the wilderness forty days, being tempted by Satan. He was with the wild animals, and angels attended him.",
    "date": "2024-09-16T09:26:15+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/i4hZCJdK3C4/maxresdefault.webp",
    "video_id": "i4hZCJdK3C4",
    "timestamp": 1726478775
  },
  {
    "title": "Forerunners of Christ | Mark 1:2-8",
    "description": "2...as it is written in Isaiah the prophet:\n“I will send my messenger ahead of you,\n    who will prepare your way”—\n3 “a voice of one calling in the wilderness,\n‘Prepare the way for the Lord,\n    make straight paths for him.’”\n4 And so John the Baptist appeared in the wilderness, preaching a baptism of repentance for the forgiveness of sins. 5 The whole Judean countryside and all the people of Jerusalem went out to him. Confessing their sins, they were baptized by him in the Jordan River. 6 John wore clothing made of camel’s hair, with a leather belt around his waist, and he ate locusts and wild honey. 7 And this was his message: “After me comes the one more powerful than I, the straps of whose sandals I am not worthy to stoop down and untie. 8 I baptize you with water, but he will baptize you with the Holy Spirit.”",
    "date": "2024-09-09T09:31:21+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/UEvJoBgm6ms/maxresdefault.webp",
    "video_id": "UEvJoBgm6ms",
    "timestamp": 1725874281
  },
  {
    "title": "The Good News of Jesus the Messiah | Mark 1:1",
    "description": "",
    "date": "2024-09-02T09:14:59+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/OCyikP6QXZU/maxresdefault.webp",
    "video_id": "OCyikP6QXZU",
    "timestamp": 1725268499
  }
]