[
  {
    "title": "A Faith That Endures  |  2 Timothy 1:3-6",
    "description": "I thank God, whom I serve, as my ancestors did, with a clear conscience, as night and day I constantly remember you in my prayers. Recalling your tears, I long to see you, so that I may be filled with joy. I am reminded of your sincere faith, which first lived in your grandmother Lois and in your mother Eunice and, I am persuaded, now lives in you also.\nFor this reason I remind you to fan into flame the gift of God, which is in you through the laying on of my hands.",
    "date": "2026-01-19T09:49:55+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/6Nc16mHlVBg/maxresdefault.webp",
    "video_id": "6Nc16mHlVBg",
    "timestamp": 1768816195
  },
  {
    "title": "Finish Faithful | 2 Timothy 1:1-2",
    "description": "2 Timothy 1:1-2\n\nPaul, an apostle of Christ Jesus by the will of God, in keeping with the promise of life that is in Christ Jesus,\nTo Timothy, my dear son:\nGrace, mercy and peace from God the Father and Christ Jesus our Lord.",
    "date": "2026-01-12T10:04:38+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/FI3Mq6fkmFI/maxresdefault.webp",
    "video_id": "FI3Mq6fkmFI",
    "timestamp": 1768212278
  },
  {
    "title": "Choosing the Good Portion | Luke 10:38-42",
    "description": "As Jesus and his disciples were on their way, he came to a village where a woman named Martha opened her home to him. She had a sister called Mary, who sat at the Lord’s feet listening to what he said. But Martha was distracted by all the preparations that had to be made. She came to him and asked, “Lord, don’t you care that my sister has left me to do the work by myself? Tell her to help me!”\n\n“Martha, Martha,” the Lord answered, “you are worried and upset about many things, but few things are needed—or indeed only one. Mary has chosen what is better, and it will not be taken away from her.”",
    "date": "2026-01-05T12:05:09+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/ngTd-DiwGwk/maxresdefault.webp",
    "video_id": "ngTd-DiwGwk",
    "timestamp": 1767614709
  },
  {
    "title": "God’s Past Record is our Future Assurance | Deuteronomy 6:4-12",
    "description": "“Listen, O Israel! The Lord is our God, the Lord alone.[a]  And you must love the Lord your God with all your heart, all your soul, and all your strength.  And you must commit yourselves wholeheartedly to these commands that I am giving you today.  Repeat them again and again to your children. Talk about them when you are at home and when you are on the road, when you are going to bed and when you are getting up. Tie them to your hands and wear them on your forehead as reminders.  Write them on the doorposts of your house and on your gates…..be careful not to forget the Lord, who rescued you from slavery in the land of Egypt.",
    "date": "2025-12-29T09:57:36+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/hLGsmXRzwzA/maxresdefault.webp",
    "video_id": "hLGsmXRzwzA",
    "timestamp": 1767002256
  },
  {
    "title": "Advent | Joy to the World | Luke 2:8–11",
    "description": "Luke 2:8–11\nAt that time the Roman emperor, Augustus, decreed that a census should be taken throughout the\nRoman Empire. 2 (This was the first census taken when Quirinius was governor of Syria.) 3 All returned to\ntheir own ancestral towns to register for this census. 4 And because Joseph was a descendant of King\nDavid, he had to go to Bethlehem in Judea, David’s ancient home. He traveled there from the village of\nNazareth in Galilee. 5 He took with him Mary, to whom he was engaged, who was now expecting a child.\n3\n6 And while they were there, the time came for her baby to be born. 7 She gave birth to her firstborn son.\nShe wrapped him snugly in strips of cloth and laid him in a manger, because there was no lodging\navailable for them.\n8 That night there were shepherds staying in the fields nearby, guarding their flocks of sheep. 9 Suddenly,\nan angel of the Lord appeared among them, and the radiance of the Lord’s glory surrounded them. They\nwere terrified, 10 but the angel reassured them. “Don’t be afraid!” he said. “I bring you good news that\nwill bring great joy to all people. 11 The Savior—yes, the Messiah, the Lord—has been born today in\nBethlehem, the city of David!12 And you will rec",
    "date": "2025-12-22T09:32:09+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/r8H5agdyZOk/maxresdefault.webp",
    "video_id": "r8H5agdyZOk",
    "timestamp": 1766395929
  },
  {
    "title": "Peace | Advent | Luke 2:8-10",
    "description": "And there were shepherds living out in the fields nearby, keeping watch over their flocks at night. An angel of the Lord appeared to them, and the glory of the Lord shone around them, and they were terrified. But the angel said to them, “Do not be afraid. I bring you good news that will cause great joy for all the people.",
    "date": "2025-12-15T09:40:42+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/_eRaLFKdUr0/maxresdefault.webp",
    "video_id": "_eRaLFKdUr0",
    "timestamp": 1765791642
  },
  {
    "title": "Hope is Here | Advent | 1 Samuel 1:4-20",
    "description": "4 Whenever the day came for Elkanah to sacrifice, he would give portions of the meat to his wife Peninnah and to all her sons and daughters. 5 But to Hannah he gave a double portion because he loved her, and the Lord had closed her womb. 6 Because the Lord had closed Hannah’s womb, her rival kept provoking her in order to irritate her. 7 This went on year after year. Whenever Hannah went up to the house of the Lord, her rival provoked her till she wept and would not eat. 8 Her husband Elkanah would say to her, “Hannah, why are you weeping? Why don’t you eat? Why are you downhearted? Don’t I mean more to you than ten sons?”\n\n9 Once when they had finished eating and drinking in Shiloh, Hannah stood up. Now Eli the priest was sitting on his chair by the doorpost of the Lord’s house. 10 In her deep anguish Hannah prayed to the Lord, weeping bitterly. 11 And she made a vow, saying, “Lord Almighty, if you will only look on your servant’s misery and remember me, and not forget your servant but give her a son, then I will give him to the Lord for all the days of his life, and no razor will ever be used on his head.”\n\n12 As she kept on praying to the Lord, Eli observed her mouth. 13 Hannah was praying in her heart, and her lips were moving but her voice was not heard. Eli thought she was drunk 14 and said to her, “How long are you going to stay drunk? Put away your wine.”\n\n15 “Not so, my lord,” Hannah replied, “I am a woman who is deeply troubled. I have not been drinking wine or beer; I was pouring out my soul to the Lord. 16 Do not take your servant for a wicked woman; I have been praying here out of my great anguish and grief.”\n\n17 Eli answered, “Go in peace, and may the God of Israel grant you what you have asked of him.”\n\n18 She said, “May your servant find favor in your eyes.” Then she went her way and ate something, and her face was no longer downcast.\n\n19 Early the next morning they arose and worshiped before the Lord and then went back to their home at Ramah. Elkanah made love to his wife Hannah, and the Lord remembered her. 20 So in the course of time Hannah became pregnant and gave birth to a son. She named him Samuel,[a] saying, “Because I asked the Lord for him.”",
    "date": "2025-12-08T09:49:33+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/AWoBm4E3W2c/maxresdefault.webp",
    "video_id": "AWoBm4E3W2c",
    "timestamp": 1765187373
  },
  {
    "title": "With Thanksgiving: The Path From Anxiety to Peace | Philippians 4:6-7",
    "description": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus.",
    "date": "2025-11-24T18:02:23+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/ZTA5pmuY0k0/maxresdefault.webp",
    "video_id": "ZTA5pmuY0k0",
    "timestamp": 1764007343
  },
  {
    "title": "The Resurrected Christ | Mark 16:1-20",
    "description": "When the Sabbath was over, Mary Magdalene, Mary the mother of James, and Salome bought spices so that they might go to anoint Jesus’ body. Very early on the first day of the week, just after sunrise, they were on their way to the tomb and they asked each other, “Who will roll the stone away from the entrance of the tomb?”\n\nBut when they looked up, they saw that the stone, which was very large, had been rolled away. As they entered the tomb, they saw a young man dressed in a white robe sitting on the right side, and they were alarmed.\n\n“Don’t be alarmed,” he said. “You are looking for Jesus the Nazarene, who was crucified. He has risen! He is not here. See the place where they laid him. But go, tell his disciples and Peter, ‘He is going ahead of you into Galilee. There you will see him, just as he told you.’”\n\nTrembling and bewildered, the women went out and fled from the tomb. They said nothing to anyone, because they were afraid.",
    "date": "2025-11-17T09:36:08+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/9oUXz96bPRE/maxresdefault.webp",
    "video_id": "9oUXz96bPRE",
    "timestamp": 1763372168
  },
  {
    "title": "The Tomb | Mark 15:42-47",
    "description": "The Burial of Jesus\nIt was Preparation Day (that is, the day before the Sabbath). So as evening approached, Joseph of Arimathea, a prominent member of the Council, who was himself waiting for the kingdom of God, went boldly to Pilate and asked for Jesus’ body. Pilate was surprised to hear that he was already dead. Summoning the centurion, he asked him if Jesus had already died. When he learned from the centurion that it was so, he gave the body to Joseph. So Joseph bought some linen cloth, took down the body, wrapped it in the linen, and placed it in a tomb cut out of rock. Then he rolled a stone against the entrance of the tomb. Mary Magdalene and Mary the mother of Joseph saw where he was laid.",
    "date": "2025-11-10T09:31:23+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/riA5NWcyHdc/maxresdefault.webp",
    "video_id": "riA5NWcyHdc",
    "timestamp": 1762767083
  },
  {
    "title": "The Cross | Mark 15:21-41",
    "description": "The Crucifixion of Jesus\nA certain man from Cyrene, Simon, the father of Alexander and Rufus, was passing by on his way in from the country, and they forced him to carry the cross. They brought Jesus to the place called Golgotha (which means “the place of the skull”). Then they offered him wine mixed with myrrh, but he did not take it. And they crucified him. Dividing up his clothes, they cast lots to see what each would get.\n\nIt was nine in the morning when they crucified him. The written notice of the charge against him read: the king of the jews.\n\nThey crucified two rebels with him, one on his right and one on his left. Those who passed by hurled insults at him, shaking their heads and saying, “So! You who are going to destroy the temple and build it in three days, come down from the cross and save yourself!” In the same way the chief priests and the teachers of the law mocked him among themselves. “He saved others,” they said, “but he can’t save himself! Let this Messiah, this king of Israel, come down now from the cross, that we may see and believe.” Those crucified with him also heaped insults on him.\n\nThe Death of Jesus\nAt noon, darkness came over the whole land until three in the afternoon. And at three in the afternoon Jesus cried out in a loud voice, “Eloi, Eloi, lema sabachthani?” (which means “My God, my God, why have you forsaken me?”).\n\nWhen some of those standing near heard this, they said, “Listen, he’s calling Elijah.”\n\nSomeone ran, filled a sponge with wine vinegar, put it on a staff, and offered it to Jesus to drink. “Now leave him alone. Let’s see if Elijah comes to take him down,” he said.\n\nWith a loud cry, Jesus breathed his last.\n\nThe curtain of the temple was torn in two from top to bottom. And when the centurion, who stood there in front of Jesus, saw how he died, he said, “Surely this man was the Son of God!”\n\nSome women were watching from a distance. Among them were Mary Magdalene, Mary the mother of James the younger and of Joseph, and Salome. In Galilee these women had followed him and cared for his needs. Many other women who had come up with him to Jerusalem were also there.",
    "date": "2025-11-03T09:40:37+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/X9SVLebiF3M/maxresdefault.webp",
    "video_id": "X9SVLebiF3M",
    "timestamp": 1762162837
  },
  {
    "title": "The King Condemned | Mark 15:1-20",
    "description": "Mark 15:1-20\nJesus Before Pilate\nVery early in the morning, the chief priests, with the elders, the teachers of the law and the whole Sanhedrin, made their plans. So they bound Jesus, led him away and handed him over to Pilate.\n\n“Are you the king of the Jews?” asked Pilate.\n\n“You have said so,” Jesus replied.\n\nThe chief priests accused him of many things. So again Pilate asked him, “Aren’t you going to answer? See how many things they are accusing you of.”\n\nBut Jesus still made no reply, and Pilate was amazed.\n\nNow it was the custom at the festival to release a prisoner whom the people requested. A man called Barabbas was in prison with the insurrectionists who had committed murder in the uprising. The crowd came up and asked Pilate to do for them what he usually did.\n\n“Do you want me to release to you the king of the Jews?” asked Pilate, knowing it was out of self-interest that the chief priests had handed Jesus over to him. But the chief priests stirred up the crowd to have Pilate release Barabbas instead.\n\n“What shall I do, then, with the one you call the king of the Jews?” Pilate asked them.\n\n“Crucify him!” they shouted.\n\n“Why? What crime has he committed?” asked Pilate.\n\nBut they shouted all the louder, “Crucify him!”\n\nWanting to satisfy the crowd, Pilate released Barabbas to them. He had Jesus flogged, and handed him over to be crucified.\n\nThe Soldiers Mock Jesus\nThe soldiers led Jesus away into the palace (that is, the Praetorium) and called together the whole company of soldiers. They put a purple robe on him, then twisted together a crown of thorns and set it on him. And they began to call out to him, “Hail, king of the Jews!” Again and again they struck him on the head with a staff and spit on him. Falling on their knees, they paid homage to him. And when they had mocked him, they took off the purple robe and put his own clothes on him. Then they led him out to crucify him.",
    "date": "2025-10-27T09:25:19+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/IkO8iiek1CY/maxresdefault.webp",
    "video_id": "IkO8iiek1CY",
    "timestamp": 1761557119
  },
  {
    "title": "Jesus in Gethsemane | Mark 14:32-52",
    "description": "Gethsemane\nThey went to a place called Gethsemane, and Jesus said to his disciples, “Sit here while I pray.” He took Peter, James and John along with him, and he began to be deeply distressed and troubled. “My soul is overwhelmed with sorrow to the point of death,” he said to them. “Stay here and keep watch.”\n\nGoing a little farther, he fell to the ground and prayed that if possible the hour might pass from him. “Abba, Father,” he said, “everything is possible for you. Take this cup from me. Yet not what I will, but what you will.”\n\nThen he returned to his disciples and found them sleeping. “Simon,” he said to Peter, “are you asleep? Couldn’t you keep watch for one hour? Watch and pray so that you will not fall into temptation. The spirit is willing, but the flesh is weak.”\n\nOnce more he went away and prayed the same thing. When he came back, he again found them sleeping, because their eyes were heavy. They did not know what to say to him.\n\nReturning the third time, he said to them, “Are you still sleeping and resting? Enough! The hour has come. Look, the Son of Man is delivered into the hands of sinners. Rise! Let us go! Here comes my betrayer!”\n\nJesus Arrested\nJust as he was speaking, Judas, one of the Twelve, appeared. With him was a crowd armed with swords and clubs, sent from the chief priests, the teachers of the law, and the elders.\n\nNow the betrayer had arranged a signal with them: “The one I kiss is the man; arrest him and lead him away under guard.” Going at once to Jesus, Judas said, “Rabbi!” and kissed him. The men seized Jesus and arrested him. Then one of those standing near drew his sword and struck the servant of the high priest, cutting off his ear.\n\n“Am I leading a rebellion,” said Jesus, “that you have come out with swords and clubs to capture me? Every day I was with you, teaching in the temple courts, and you did not arrest me. But the Scriptures must be fulfilled.” Then everyone deserted him and fled.\n\nA young man, wearing nothing but a linen garment, was following Jesus. When they seized him, he fled naked, leaving his garment behind.",
    "date": "2025-10-13T09:36:14+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/bl9_2tPWVkw/maxresdefault.webp",
    "video_id": "bl9_2tPWVkw",
    "timestamp": 1760348174
  },
  {
    "title": "Reality Honolulu Anniversary 2025 | Ephesians 3:14-21",
    "description": "Ephesians 3:14-21\n\nA Prayer for the Ephesians\nFor this reason I kneel before the Father, from whom every family in heaven and on earth derives its name. I pray that out of his glorious riches he may strengthen you with power through his Spirit in your inner being, so that Christ may dwell in your hearts through faith. And I pray that you, being rooted and established in love, may have power, together with all the Lord’s holy people, to grasp how wide and long and high and deep is the love of Christ, and to know this love that surpasses knowledge—that you may be filled to the measure of all the fullness of God.\n\nNow to him who is able to do immeasurably more than all we ask or imagine, according to his power that is at work within us, to him be glory in the church and in Christ Jesus throughout all generations, for ever and ever! Amen.",
    "date": "2025-10-06T09:35:33+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/pFxV7A07QBw/maxresdefault.webp",
    "video_id": "pFxV7A07QBw",
    "timestamp": 1759743333
  },
  {
    "title": "The Last Supper | Mark 14:12-31",
    "description": "Mark 14.12-31\n12 On the first day of the Festival of Unleavened Bread, when the Passover lamb is sacrificed, Jesus’ disciples asked him, “Where do you want us to go to prepare the Passover meal for you?”\n13 So Jesus sent two of them into Jerusalem with these instructions: “As you go into the city, a man carrying a pitcher of water will meet you. Follow him. 14 At the house he enters, say to the owner, ‘The Teacher asks: Where is the guest room where I can eat the Passover meal with my disciples?’15 He will take you upstairs to a large room that is already set up. That is where you should prepare our meal.” 16 So the two disciples went into the city and found everything just as Jesus had said, and they prepared the Passover meal there.\n17 In the evening Jesus arrived with the Twelve. 18 As they were at the table eating, Jesus said, “I tell you the truth, one of you eating with me here will betray me.”\n19 Greatly distressed, each one asked in turn, “Am I the one?”\n20 He replied, “It is one of you twelve who is eating from this bowl with me.21 For the Son of Man must die, as the Scriptures declared long ago. But how terrible it will be for the one who betrays him. It would be far better for that man if he had never been born!”\n22 As they were eating, Jesus took some bread and blessed it. Then he broke it in pieces and gave it to the disciples, saying, “Take it, for this is my body.”\n23 And he took a cup of wine and gave thanks to God for it. He gave it to them, and they all drank from it. 24 And he said to them, “This is my blood, which confirms the covenant[c] between God and his people. It is poured out as a sacrifice for many. 25 I tell you the truth, I will not drink wine again until the day I drink it new in the Kingdom of God.”\n26 Then they sang a hymn and went out to the Mount of Olives.\n27 On the way, Jesus told them, “All of you will desert me. For the Scriptures say,\n‘God will strike the Shepherd,    and the sheep will be scattered.’\n28 But after I am raised from the dead, I will go ahead of you to Galilee and meet you there.”\n29 Peter said to him, “Even if everyone else deserts you, I never will.”\n30 Jesus replied, “I tell you the truth, Peter—this very night, before the rooster crows twice, you will deny three times that you even know me.”\n31 “No!” Peter declared emphatically. “Even if I have to die with you, I will never deny you!” And all the others vowed the same.",
    "date": "2025-09-29T09:41:37+00:00",
    "thumbnail_url": "https://i.ytimg.com/vi_webp/TA4Ix_KryRw/maxresdefault.webp",
    "video_id": "TA4Ix_KryRw",
    "timestamp": 1759138897
  }
]